zhaoyunsong/PY32F003_boot_led/.pack/Puya/PY32F0xx_DFP.1.2.2/Drivers/CMSIS/Device/PY32F0xx/Include/py32f072ex6.h
/*!< CAN_WECR */
#define CAN_WECR_EWL_Pos                        (0U)
#define CAN_WECR_EWL_Msk                        (0xFUL << CAN_WECR_EWL_Pos)                     /*!< 0x0000000F */
#define CAN_WECR_EWL                            CAN_WECR_EWL_Msk                                /*!< EWL[3:0] bits (desc EWL) */
#define CAN_WECR_EWL_0                          (0x1UL << CAN_WECR_EWL_Pos)                     /*!< 0x00000001 */
#define CAN_WECR_EWL_1                          (0x2UL << CAN_WECR_EWL_Pos)                     /*!< 0x00000002 */
#define CAN_WECR_EWL_2                          (0x4UL << CAN_WECR_EWL_Pos)                     /*!< 0x00000004 */
#define CAN_WECR_EWL_3                          (0x8UL << CAN_WECR_EWL_Pos)                     /*!< 0x00000008 */
#define CAN_WECR_AFWL_Pos                       (4U)
#define CAN_WECR_AFWL_Msk                       (0xFUL << CAN_WECR_AFWL_Pos)                    /*!< 0x000000F0 */
#define CAN_WECR_AFWL                           CAN_WECR_AFWL_Msk                               /*!< AFWL[7:4] bits (desc AFWL) */
#define CAN_WECR_AFWL_0                         (0x1UL << CAN_WECR_AFWL_Pos)                    /*!< 0x00000010 */
#define CAN_WECR_AFWL_1                         (0x2UL << CAN_WECR_AFWL_Pos)                    /*!< 0x00000020 */
#define CAN_WECR_AFWL_2                         (0x4UL << CAN_WECR_AFWL_Pos)                    /*!< 0x00000040 */
#define CAN_WECR_AFWL_3                         (0x8UL << CAN_WECR_AFWL_Pos)                    /*!< 0x00000080 */
#define CAN_WECR_ALC_Pos                        (8U)
#define CAN_WECR_ALC_Msk                        (0x1FUL << CAN_WECR_ALC_Pos)                    /*!< 0x00001F00 */
#define CAN_WECR_ALC                            CAN_WECR_ALC_Msk                                /*!< ALC[12:8] bits (desc ALC) */
#define CAN_WECR_ALC_0                          (0x1UL << CAN_WECR_ALC_Pos)                     /*!< 0x00000100 */
#define CAN_WECR_ALC_1                          (0x2UL << CAN_WECR_ALC_Pos)                     /*!< 0x00000200 */
#define CAN_WECR_ALC_2                          (0x4UL << CAN_WECR_ALC_Pos)                     /*!< 0x00000400 */
#define CAN_WECR_ALC_3                          (0x8UL << CAN_WECR_ALC_Pos)                     /*!< 0x00000800 */
#define CAN_WECR_ALC_4                          (0x10UL << CAN_WECR_ALC_Pos)                    /*!< 0x00001000 */
#define CAN_WECR_KOER_Pos                       (13U)
#define CAN_WECR_KOER_Msk                       (0x7UL << CAN_WECR_KOER_Pos)                    /*!< 0x0000E000 */
#define CAN_WECR_KOER                           CAN_WECR_KOER_Msk                               /*!< KOER[15:13] bits (desc KOER) */
#define CAN_WECR_KOER_0                         (0x1UL << CAN_WECR_KOER_Pos)                    /*!< 0x00002000 */
#define CAN_WECR_KOER_1                         (0x2UL << CAN_WECR_KOER_Pos)                    /*!< 0x00004000 */
#define CAN_WECR_KOER_2                         (0x4UL << CAN_WECR_KOER_Pos)                    /*!< 0x00008000 */
#define CAN_WECR_RECNT_Pos                      (16U)
#define CAN_WECR_RECNT_Msk                      (0xFFUL << CAN_WECR_RECNT_Pos)                  /*!< 0x00FF0000 */
#define CAN_WECR_RECNT                          CAN_WECR_RECNT_Msk                              /*!< RECNT[23:16] bits (desc RECNT) */
#define CAN_WECR_TECNT_Pos                      (24U)
#define CAN_WECR_TECNT_Msk                      (0xFFUL << CAN_WECR_TECNT_Pos)                  /*!< 0xFF000000 */
#define CAN_WECR_TECNT                          CAN_WECR_TECNT_Msk                              /*!< TECNT[31:24] bits (desc TECNT) */

/*!< CAN_REFMSG */
#define CAN_REFMSG_REF_ID_Pos                   (0U)
#define CAN_REFMSG_REF_ID_Msk                   (0x1FFFFFFFUL << CAN_REFMSG_REF_ID_Pos)         /*!< 0x1FFFFFFF */
#define CAN_REFMSG_REF_ID                       CAN_REFMSG_REF_ID_Msk                           /*!< REF_ID[28:0] bits (desc REF_ID) */
#define CAN_REFMSG_REF_IDE_Pos                  (31U)
#define CAN_REFMSG_REF_IDE_Msk                  (0x1UL << CAN_REFMSG_REF_IDE_Pos)               /*!< 0x80000000 */
#define CAN_REFMSG_REF_IDE                      CAN_REFMSG_REF_IDE_Msk                          /*!< desc REF_IDE */

/*!< CAN_TTCR */
#define CAN_TTCR_TTPTR_Pos                      (0U)
#define CAN_TTCR_TTPTR_Msk                      (0x3FUL << CAN_TTCR_TTPTR_Pos)                  /*!< 0x0000003F */
#define CAN_TTCR_TTPTR                          CAN_TTCR_TTPTR_Msk                              /*!< TTPTR[5:0] bits (desc TTPTR) */
#define CAN_TTCR_TTPTR_0                        (0x1UL << CAN_TTCR_TTPTR_Pos)                   /*!< 0x00000001 */
#define CAN_TTCR_TTPTR_1                        (0x2UL << CAN_TTCR_TTPTR_Pos)                   /*!< 0x00000002 */
#define CAN_TTCR_TTPTR_2                        (0x4UL << CAN_TTCR_TTPTR_Pos)                   /*!< 0x00000004 */
#define CAN_TTCR_TTPTR_3                        (0x8UL << CAN_TTCR_TTPTR_Pos)                   /*!< 0x00000008 */
#define CAN_TTCR_TTPTR_4                        (0x10UL << CAN_TTCR_TTPTR_Pos)                  /*!< 0x00000010 */
#define CAN_TTCR_TTPTR_5                        (0x20UL << CAN_TTCR_TTPTR_Pos)                  /*!< 0x00000020 */
#define CAN_TTCR_TTYPE_Pos                      (8U)
#define CAN_TTCR_TTYPE_Msk                      (0x7UL << CAN_TTCR_TTYPE_Pos)                   /*!< 0x00000700 */
#define CAN_TTCR_TTYPE                          CAN_TTCR_TTYPE_Msk                              /*!< TTYPE[10:8] bits (desc TTYPE) */
#define CAN_TTCR_TTYPE_0                        (0x1UL << CAN_TTCR_TTYPE_Pos)                   /*!< 0x00000100 */
#define CAN_TTCR_TTYPE_1                        (0x2UL << CAN_TTCR_TTYPE_Pos)                   /*!< 0x00000200 */
#define CAN_TTCR_TTYPE_2                        (0x4UL << CAN_TTCR_TTYPE_Pos)                   /*!< 0x00000400 */
#define CAN_TTCR_TEW_Pos                        (12U)
#define CAN_TTCR_TEW_Msk                        (0xFUL << CAN_TTCR_TEW_Pos)                     /*!< 0x0000F000 */
#define CAN_TTCR_TEW                            CAN_TTCR_TEW_Msk                                /*!< TEW[15:12] bits (desc TEW) */
#define CAN_TTCR_TEW_0                          (0x1UL << CAN_TTCR_TEW_Pos)                     /*!< 0x00001000 */
#define CAN_TTCR_TEW_1                          (0x2UL << CAN_TTCR_TEW_Pos)                     /*!< 0x00002000 */
#define CAN_TTCR_TEW_2                          (0x4UL << CAN_TTCR_TEW_Pos)                     /*!< 0x00004000 */
#define CAN_TTCR_TEW_3                          (0x8UL << CAN_TTCR_TEW_Pos)                     /*!< 0x00008000 */
#define CAN_TTCR_TBPTR_Pos                      (16U)
#define CAN_TTCR_TBPTR_Msk                      (0x3FUL << CAN_TTCR_TBPTR_Pos)                  /*!< 0x003F0000 */
#define CAN_TTCR_TBPTR                          CAN_TTCR_TBPTR_Msk                              /*!< TBPTR[21:16] bits (desc TBPTR) */
#define CAN_TTCR_TBPTR_0                        (0x1UL << CAN_TTCR_TBPTR_Pos)                   /*!< 0x00010000 */
#define CAN_TTCR_TBPTR_1                        (0x2UL << CAN_TTCR_TBPTR_Pos)                   /*!< 0x00020000 */
#define CAN_TTCR_TBPTR_2                        (0x4UL << CAN_TTCR_TBPTR_Pos)                   /*!< 0x00040000 */
#define CAN_TTCR_TBPTR_3                        (0x8UL << CAN_TTCR_TBPTR_Pos)                   /*!< 0x00080000 */
#define CAN_TTCR_TBPTR_4                        (0x10UL << CAN_TTCR_TBPTR_Pos)                  /*!< 0x00100000 */
#define CAN_TTCR_TBPTR_5                        (0x20UL << CAN_TTCR_TBPTR_Pos)                  /*!< 0x00200000 */
#define CAN_TTCR_TBF_Pos                        (22U)
#define CAN_TTCR_TBF_Msk                        (0x1UL << CAN_TTCR_TBF_Pos)                     /*!< 0x00400000 */
#define CAN_TTCR_TBF                            CAN_TTCR_TBF_Msk                                /*!< desc TBF */
#define CAN_TTCR_TBE_Pos                        (23U)
#define CAN_TTCR_TBE_Msk                        (0x1UL << CAN_TTCR_TBE_Pos)                     /*!< 0x00800000 */
#define CAN_TTCR_TBE                            CAN_TTCR_TBE_Msk                                /*!< desc TBE */
#define CAN_TTCR_TTEN_Pos                       (24U)
#define CAN_TTCR_TTEN_Msk                       (0x1UL << CAN_TTCR_TTEN_Pos)                    /*!< 0x01000000 */
#define CAN_TTCR_TTEN                           CAN_TTCR_TTEN_Msk                               /*!< desc TTEN */
#define CAN_TTCR_T_PRESC_Pos                    (25U)
#define CAN_TTCR_T_PRESC_Msk                    (0x3UL << CAN_TTCR_T_PRESC_Pos)                 /*!< 0x06000000 */
#define CAN_TTCR_T_PRESC                        CAN_TTCR_T_PRESC_Msk                            /*!< T_PRESC[26:25] bits (desc T_PRESC) */
#define CAN_TTCR_T_PRESC_0                      (0x1UL << CAN_TTCR_T_PRESC_Pos)                 /*!< 0x02000000 */
#define CAN_TTCR_T_PRESC_1                      (0x2UL << CAN_TTCR_T_PRESC_Pos)                 /*!< 0x04000000 */

/*!< CAN_TTTR */
#define CAN_TTTR_TT_TRIG_Pos                    (0U)
#define CAN_TTTR_TT_TRIG_Msk                    (0xFFFFUL << CAN_TTTR_TT_TRIG_Pos)              /*!< 0x0000FFFF */
#define CAN_TTTR_TT_TRIG                        CAN_TTTR_TT_TRIG_Msk                            /*!< TT_TRIG[15:0] bits (desc TT_TRIG) */
#define CAN_TTTR_TT_WTRIG_Pos                   (16U)
#define CAN_TTTR_TT_WTRIG_Msk                   (0xFFFFUL << CAN_TTTR_TT_WTRIG_Pos)             /*!< 0xFFFF0000 */
#define CAN_TTTR_TT_WTRIG                       CAN_TTTR_TT_WTRIG_Msk                           /*!< TT_WTRIG[31:16] bits (desc TT_WTRIG) */

/*!< CAN_SCMS */
#define CAN_SCMS_FSTIM_Pos                      (1U)
#define CAN_SCMS_FSTIM_Msk                      (0x7UL << CAN_SCMS_FSTIM_Pos)                   /*!< 0x0000000E */
#define CAN_SCMS_FSTIM                          CAN_SCMS_FSTIM_Msk                              /*!< FSTIM[3:1] bits (desc FSTIM) */
#define CAN_SCMS_FSTIM_0                        (0x1UL << CAN_SCMS_FSTIM_Pos)                   /*!< 0x00000002 */
#define CAN_SCMS_FSTIM_1                        (0x2UL << CAN_SCMS_FSTIM_Pos)                   /*!< 0x00000004 */
#define CAN_SCMS_FSTIM_2                        (0x4UL << CAN_SCMS_FSTIM_Pos)                   /*!< 0x00000008 */
#define CAN_SCMS_ACFA_Pos                       (24U)
#define CAN_SCMS_ACFA_Msk                       (0x1UL << CAN_SCMS_ACFA_Pos)                    /*!< 0x01000000 */
#define CAN_SCMS_ACFA                           CAN_SCMS_ACFA_Msk                               /*!< desc ACFA */
#define CAN_SCMS_TXS_Pos                        (25U)
#define CAN_SCMS_TXS_Msk                        (0x1UL << CAN_SCMS_TXS_Pos)                     /*!< 0x02000000 */
#define CAN_SCMS_TXS                            CAN_SCMS_TXS_Msk                                /*!< desc TXS */
#define CAN_SCMS_TXB_Pos                        (26U)
#define CAN_SCMS_TXB_Msk                        (0x1UL << CAN_SCMS_TXB_Pos)                     /*!< 0x04000000 */
#define CAN_SCMS_TXB                            CAN_SCMS_TXB_Msk                                /*!< desc TXB */
#define CAN_SCMS_HELOC_Pos                      (27U)
#define CAN_SCMS_HELOC_Msk                      (0x3UL << CAN_SCMS_HELOC_Pos)                   /*!< 0x18000000 */
#define CAN_SCMS_HELOC                          CAN_SCMS_HELOC_Msk                              /*!< HELOC[28:27] bits (desc HELOC) */
#define CAN_SCMS_HELOC_0                        (0x1UL << CAN_SCMS_HELOC_Pos)                   /*!< 0x08000000 */
#define CAN_SCMS_HELOC_1                        (0x2UL << CAN_SCMS_HELOC_Pos)                   /*!< 0x10000000 */

/*!< CAN_ACFCR */
#define CAN_ACFCR_ACFADR_Pos                    (0U)
#define CAN_ACFCR_ACFADR_Msk                    (0xFUL << CAN_ACFCR_ACFADR_Pos)                 /*!< 0x0000000F */
#define CAN_ACFCR_ACFADR                        CAN_ACFCR_ACFADR_Msk                            /*!< ACFADR[3:0] bits (desc ACFADR) */
#define CAN_ACFCR_ACFADR_0                      (0x1UL << CAN_ACFCR_ACFADR_Pos)                 /*!< 0x00000001 */
#define CAN_ACFCR_ACFADR_1                      (0x2UL << CAN_ACFCR_ACFADR_Pos)                 /*!< 0x00000002 */
#define CAN_ACFCR_ACFADR_2                      (0x4UL << CAN_ACFCR_ACFADR_Pos)                 /*!< 0x00000004 */
#define CAN_ACFCR_ACFADR_3                      (0x8UL << CAN_ACFCR_ACFADR_Pos)                 /*!< 0x00000008 */
#define CAN_ACFCR_AE_0_Pos                      (16U)
#define CAN_ACFCR_AE_0_Msk                      (0x1UL << CAN_ACFCR_AE_0_Pos)                   /*!< 0x00010000 */
#define CAN_ACFCR_AE_0                          CAN_ACFCR_AE_0_Msk                              /*!< desc AE_0 */
#define CAN_ACFCR_AE_1_Pos                      (17U)
#define CAN_ACFCR_AE_1_Msk                      (0x1UL << CAN_ACFCR_AE_1_Pos)                   /*!< 0x00020000 */
#define CAN_ACFCR_AE_1                          CAN_ACFCR_AE_1_Msk                              /*!< desc AE_1 */
#define CAN_ACFCR_AE_2_Pos                      (18U)
#define CAN_ACFCR_AE_2_Msk                      (0x1UL << CAN_ACFCR_AE_2_Pos)                   /*!< 0x00040000 */
#define CAN_ACFCR_AE_2                          CAN_ACFCR_AE_2_Msk                              /*!< desc AE_2 */
#define CAN_ACFCR_AE_3_Pos                      (19U)
#define CAN_ACFCR_AE_3_Msk                      (0x1UL << CAN_ACFCR_AE_3_Pos)                   /*!< 0x00080000 */
#define CAN_ACFCR_AE_3                          CAN_ACFCR_AE_3_Msk                              /*!< desc AE_3 */
#define CAN_ACFCR_AE_4_Pos                      (20U)
#define CAN_ACFCR_AE_4_Msk                      (0x1UL << CAN_ACFCR_AE_4_Pos)                   /*!< 0x00100000 */
#define CAN_ACFCR_AE_4                          CAN_ACFCR_AE_4_Msk                              /*!< desc AE_4 */
#define CAN_ACFCR_AE_5_Pos                      (21U)
#define CAN_ACFCR_AE_5_Msk                      (0x1UL << CAN_ACFCR_AE_5_Pos)                   /*!< 0x00200000 */
#define CAN_ACFCR_AE_5                          CAN_ACFCR_AE_5_Msk                              /*!< desc AE_5 */
#define CAN_ACFCR_AE_6_Pos                      (22U)
#define CAN_ACFCR_AE_6_Msk                      (0x1UL << CAN_ACFCR_AE_6_Pos)                   /*!< 0x00400000 */
#define CAN_ACFCR_AE_6                          CAN_ACFCR_AE_6_Msk                              /*!< desc AE_6 */
#define CAN_ACFCR_AE_7_Pos                      (23U)
#define CAN_ACFCR_AE_7_Msk                      (0x1UL << CAN_ACFCR_AE_7_Pos)                   /*!< 0x00800000 */
#define CAN_ACFCR_AE_7                          CAN_ACFCR_AE_7_Msk                              /*!< desc AE_7 */
#define CAN_ACFCR_AE_8_Pos                      (24U)
#define CAN_ACFCR_AE_8_Msk                      (0x1UL << CAN_ACFCR_AE_8_Pos)                   /*!< 0x01000000 */
#define CAN_ACFCR_AE_8                          CAN_ACFCR_AE_8_Msk                              /*!< desc AE_8 */
#define CAN_ACFCR_AE_9_Pos                      (25U)
#define CAN_ACFCR_AE_9_Msk                      (0x1UL << CAN_ACFCR_AE_9_Pos)                   /*!< 0x02000000 */
#define CAN_ACFCR_AE_9                          CAN_ACFCR_AE_9_Msk                              /*!< desc AE_9 */
#define CAN_ACFCR_AE_10_Pos                     (26U)
#define CAN_ACFCR_AE_10_Msk                     (0x1UL << CAN_ACFCR_AE_10_Pos)                  /*!< 0x04000000 */
#define CAN_ACFCR_AE_10                         CAN_ACFCR_AE_10_Msk                             /*!< desc AE_10 */
#define CAN_ACFCR_AE_11_Pos                     (27U)
#define CAN_ACFCR_AE_11_Msk                     (0x1UL << CAN_ACFCR_AE_11_Pos)                  /*!< 0x08000000 */
#define CAN_ACFCR_AE_11                         CAN_ACFCR_AE_11_Msk                             /*!< desc AE_11 */

